# -*- coding: utf-8 -*-

"""
Задание 1

Создайте массив Numpy под названием a размером 5x2, то
есть состоящий из 5 строк и 2 столбцов. Первый столбец
должен содержать числа 1, 2, 3, 3, 1, а второй - числа
6, 8, 11, 10, 7. Будем считать, что каждый столбец -
это признак, а строка - наблюдение. Затем найдите
среднее значение по каждому признаку, используя метод
mean массива Numpy. Результат запишите в массив mean_a,
в нем должно быть 2 элемента.
"""

import numpy as np

a = np.array([[1, 6], [2, 8], [3, 11], [3, 10], [1, 7]])

mean_a = np.mean(a, 0)
print("\nmean_a:")
print(mean_a)




"""
Задание 2

Вычислите массив a_centered, отняв от значений массива
"а" средние значения соответствующих признаков,
содержащиеся в массиве mean_a. Вычисление должно
производиться в одно действие. Получившийся массив
должен иметь размер 5x2.
"""

a_centered = a - mean_a.T

print("\na_centered:")
print(a_centered)




"""
Задание 3

Найдите скалярное произведение столбцов массива
a_centered. В результате должна получиться величина
a_centered_sp. Затем поделите a_centered_sp на N-1,
где N - число наблюдений.
"""

a_centered_sp = np.dot(a_centered.T[0], a_centered.T[1])

print("\na_centered_sp:")
print(a_centered_sp)

print("\na_centered_sp / (N-1):")
print(a_centered_sp / (np.size(a, 0) - 1))
